hybridMultiphaseFoamV7/tutorials/Free_Flow_Cases/Flat_Plate_Contact_Angle/porous_Boundary/constant/transportPropertiesOld
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (wetting nonwetting);

wetting //alpha=1 wetting alpha1 ("b" if compared to multiphase toolbox)
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1e-6;
    rho             [1 -3 0 0 0 0 0] 980;
}

nonwetting //alpha=0 nonwetting alpha2 = 1-alpha1 ("a" in multiphase toolbox)
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.45e-5; //in unitns of kinematic viscocity
    rho             [1 -3 0 0 0 0 0] 1.226;
}

sigma            [1 0 -2 0 0 0 0]  0.15;  //0.097;

k01              [0 2 0 0 0 0 0] 1e-15;

k02              [0 2 0 0 0 0 0] 1e-10; //second phase does not like to be in clay

theta0           150; //second phase does not like to be in clay

//Permeability Coefficients

alpha1IrrPerm      [0 0 0 0 0 0 0] 0;

alpha2IrrPerm      [0 0 0 0 0 0 0]  0;

//Capillary Pressure Coefficients

m                  [0 0 0 0 0 0 0] 3;

a                  [0 0 0 0 0 0 0] 0.5;

alpha1IrrPres      [0 0 0 0 0 0 0] 0;

alpha1MaxPres      [0 0 0 0 0 0 0] 1;

Pc0                [1 -1 -2 0 0 0 0] 5;

PcMax              [1 -1 -2 0 0 0 0] 50;

// ************************************************************************* //
