hybridMultiphaseFoamV7/tutorials/Free_Flow_Cases/Flat_Plate_Contact_Angle/porous_Boundary/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue epss 1e-20
    volScalarFieldValue alpha.wetting 0
);

regions
(

     boxToCell
    {
        box (0.25 0.02 0) (0.35 0.10 0.1);
        fieldValues
        (
            volScalarFieldValue alpha.wetting 1
        );
    }

    boxToCell
    {
        box (0 0 0) (0.6 0.02 0.1);
        fieldValues
        (
            volScalarFieldValue eps 0.001 //0.99
	    volScalarFieldValue alpha.wetting 1
	     	
        );
    }

);


// ************************************************************************* //
